{
  "version": "0.1.0",
  "model_type": "gemma3_text",
  "quantization": "q4f16_1",
  "model_config": {
    "text_config": {
      "hidden_size": 1152,
      "intermediate_size": 6912,
      "num_hidden_layers": 26,
      "attention_bias": false,
      "num_attention_heads": 4,
      "num_key_value_heads": 1,
      "head_dim": 256,
      "rms_norm_eps": 1e-06,
      "hidden_activation": "gelu_pytorch_tanh",
      "position_embedding_base": 1000000,
      "context_window_size": 8192,
      "prefill_chunk_size": 8192,
      "query_pre_attn_scalar": 256,
      "sliding_window": 512,
      "kwargs": {
        "architectures": [
          "Gemma3ForCausalLM"
        ],
        "attention_dropout": 0.0,
        "attn_logit_softcapping": null,
        "bos_token_id": 2,
        "cache_implementation": "hybrid",
        "eos_token_id": 1,
        "final_logit_softcapping": null,
        "initializer_range": 0.02,
        "max_position_embeddings": 32768,
        "model_type": "gemma3_text",
        "pad_token_id": 0,
        "rope_local_base_freq": 10000,
        "rope_scaling": null,
        "sliding_window_pattern": 6,
        "torch_dtype": "bfloat16",
        "transformers_version": "4.52.0.dev0",
        "use_cache": true
      }
    },
    "vocab_size": 262144,
    "tensor_parallel_shards": 1,
    "max_batch_size": 128,
    "context_window_size": 768,
    "sliding_window_size": -1,
    "prefill_chunk_size": 8192,
    "is_text_model": true
  },
  "vocab_size": 262144,
  "context_window_size": 768,
  "sliding_window_size": -1,
  "prefill_chunk_size": 8192,
  "attention_sink_size": -1,
  "tensor_parallel_shards": 1,
  "pipeline_parallel_stages": 1,
  "temperature": 1.0,
  "presence_penalty": 0.0,
  "frequency_penalty": 0.0,
  "repetition_penalty": 1.0,
  "top_p": 0.95,
  "tokenizer_files": [
    "tokenizer.model",
    "tokenizer.json",
    "added_tokens.json",
    "tokenizer_config.json"
  ],
  "tokenizer_info": {
    "token_postproc_method": "byte_fallback",
    "prepend_space_in_encode": false,
    "strip_space_in_decode": false
  },
  "conv_template": {
    "name": "redpajama_chat",
    "system_template": "{system_message}",
    "system_message": "",
    "system_prefix_token_ids": null,
    "add_role_after_system_message": true,
    "roles": {
      "user": "<human>",
      "assistant": "<bot>"
    },
    "role_templates": {
      "user": "{user_message}",
      "assistant": "{assistant_message}",
      "tool": "{tool_message}"
    },
    "messages": [],
    "seps": [
      "\n"
    ],
    "role_content_sep": ": ",
    "role_empty_sep": ":",
    "stop_str": [
      "<human>"
    ],
    "stop_token_ids": [
      0
    ],
    "function_string": "",
    "use_function_calling": false
  },
  "pad_token_id": 0,
  "bos_token_id": 2,
  "eos_token_id": [
    1,
    106
  ]
}